BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90CAN64.PIC
        <edc:SFRDef edc:_addr="0xDE" edc:access="nnnnnnnn" edc:cname="CANIE2" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEMOB" edc:desc="Interrupt Enable by MOb" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDF" edc:access="-nnnnnnn" edc:cname="CANIE1" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEMOB" edc:desc="Interrupt Enable by MOb" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE0" edc:access="nnnnnnnn" edc:cname="CANSIT2" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SIT" edc:desc="Status of Interrupt by MOb" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE1" edc:access="-nnnnnnn" edc:cname="CANSIT1" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SIT" edc:desc="Status of Interrupt by MOb" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE2" edc:access="-nnnnnn-" edc:cname="CANBT1" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP" edc:desc="Baud Rate Prescaler bits" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE3" edc:access="-nn-nnn-" edc:cname="CANBT2" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PRS" edc:desc="Propagation Time Segment" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SJW" edc:desc="Re-Sync Jump Width" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE4" edc:access="-nnnnnnn" edc:cname="CANBT3" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="Sample Type" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHS1" edc:desc="Phase Segment 1" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PHS2" edc:desc="Phase Segments" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE5" edc:access="nnnnnnnn" edc:cname="CANTCON" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TPRSC" edc:desc="CAN Timer Prescaler" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE6" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CANTIM" edc:nzwidth="0x10" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CANTIM" edc:desc="CAN Timer Count" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CANTTC" edc:nzwidth="0x10" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TIMTTC" edc:desc="TTC Timer Count" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEA" edc:access="nnnnnnnn" edc:cname="CANTEC" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TEC" edc:desc="Trasnmit Error Count" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEB" edc:access="nnnnnnnn" edc:cname="CANREC" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="REC" edc:desc="Receive Error Count" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEC" edc:access="nnnnnnnn" edc:cname="CANHPMOB" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGP" edc:desc="CAN General purpose bits" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="HPMOB" edc:desc="Highest Priority MOb number" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xED" edc:access="nnnnnnnn" edc:cname="CANPAGE" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDX" edc:desc="Data Buffer Index Bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="AINC" edc:desc="MOb Data Buffer Auto Increment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MOBNB" edc:desc="MOb Number Bits" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEE" edc:access="nnnnnnnn" edc:cname="CANSTMOB" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AERR" edc:desc="Ackknowledgement Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="Form Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CERR" edc:desc="CRC Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SERR" edc:desc="Stuff Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BERR" edc:desc="Bit Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOK" edc:desc="Receive OK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXOK" edc:desc="Transmit OK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLCW" edc:desc="Data Length Code Warning" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEF" edc:access="nnnnnnnn" edc:cname="CANCDMOB" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC" edc:desc="Data Length Code Bits" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="IDE" edc:desc="Identifier Extension" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RPLV" edc:desc="Reply Valid" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CONMOB" edc:desc="MOb Config Bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nnnnnnnn" edc:cname="CANIDT4" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0TAG" edc:desc="Reserved Bit 0 Tag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1TAG" edc:desc="Reserved Bit 1 Tag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTRTAG" edc:desc="Remote Trasnmission Request Tag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDT" edc:desc="Identifier Tag" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="CANIDT3" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IDT" edc:desc="Identifier Tag" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
